app/views/books/_index.html.erb

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
---
          <div class="comments">
          <p>コメント件数：<%= book.book_comments.count %></p>