app/views/books/_index.html.erb

SELECT "books".* FROM "books"
---
          <div class="comments">
          <p>コメント件数：<%= book.book_comments.count %></p>