app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "aaaa"], ["user_id", 1], ["book_id", 2], ["created_at", "2021-02-03 04:49:01.239536"], ["updated_at", "2021-02-03 04:49:01.239536"]]
---
  def create
    @book = Book.find(params[:book_id])
    @book_comment = current_user.book_comments.build(book_comment_params)
    @book_comment.book_id = @book.id
    @book_comment.save

DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 2]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["id", 2], ["book_id", 2], ["LIMIT", 1]]
---
  def destroy
    @book = Book.find(params[:book_id])
    @book_comment = BookComment.find_by(id: params[:id], book_id: params[:book_id]).destroy