app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book), notice: "You have created book successfully."
    else
      @user = current_user
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ほうほうおふおううお"], ["body", "ほうほうほうおおお\r\n"], ["user_id", 1], ["created_at", "2021-02-03 04:53:32.318161"], ["updated_at", "2021-02-03 04:53:32.318161"]]
SELECT "books".* FROM "books"