app/controllers/searches_controller.rb

SELECT "users".* FROM "users" WHERE (name LIKE'Hello%')
SELECT "books".* FROM "books" WHERE (ぽぽぽぽ)
---
  def search
    @range = params[:range]
    search = params[:search]
    word = params[:word]

    if @range == '1'
      @user = User.search(search,word)
    else
      @book = Book.search(search,word)