app/controllers/users_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])
    @books = @user.books
    @book = Book.new
    @book_id = Book.find(params[:id])