app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @books = @user.books
    @book = Book.new
    # @book_id = Book.find(params[:id])
    @book_comment = BookComment.new
    @relationship = @user.relationships.find_by(follow_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."follow_id" = ? LIMIT ?  [["user_id", 3], ["follow_id", 3], ["LIMIT", 1]]

  def index
    @user = current_user
    @book = Book.new
    @users = User.all
    @relationship = @user.relationships.find_by(follow_id: @user.id)
---
SELECT "users".* FROM "users"
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."follow_id" = ? LIMIT ?  [["user_id", 4], ["follow_id", 4], ["LIMIT", 1]]

  def followings
    @user = User.find(params[:id])
    @users = @user.followings.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]